{"id":"73902230","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Business development manager in IT (remote)","insider_interview":null,"response_letter_required":true,"area":{"id":"2108","name":"Индонезия","url":"https://api.hh.ru/areas/2108?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>We are looking for an experienced business development manager from anywhere in the world.</strong></p> <p><strong>MadAppGang is a custom development company headquartered in Australia, Sydney.</strong></p> <p>It was founded by an experienced software engineer, Jack Rudenko, in 2011. We have outsourcing, outstaffing and our own projects.</p> <p>MadAppGang’s engineering culture is focused on development and work, not bullshit and bureaucracy. Our company was created by engineers for engineers to work with maximum efficiency and pleasure in a team with cool professionals. The company&#39;s culture is based on Rework and Remote from 37Signals.</p> <p><strong>About our founder</strong></p> <p>Jack has over 25 years of experience building software. He&#39;s an AWS certified Solution Architect and a lead developer behind Evergen, WebMoney, and Moyo TV.</p> <p><strong>Our team</strong></p> <p>The development team is distributed and works remotely from different parts of the world. It consists of 44 amazing people: a founder/CTO, CEO, backend, frontend, mobile developers, an Art director, a</p> <p>UX/UI designer, DevOps engineers, a QA engineer, and Project managers.</p> <p>The team is mostly Russian-speaking, but we are moving towards diversity now.</p> <p><strong>Our projects</strong></p> <p>We develop digital products for the web, mobile and cloud. Years of experience and numerous projects with clients of different calibre from all around the globe give us the ability to tailor digital solutions that are a perfect balance between complexity, delivery time and cost. Over the past decade, we`ve built dozens of solutions for the fintech, energy, healthcare, fitness, transportation, and food industries.</p> <p>All our projects are international (Europe, America, Asia and Australia), excluding CIS. Therefore, our second language of communication is English.</p> <p><strong>About the role </strong></p> <p>For 11 years our clients have come by word of mouth or through the IT community.</p> <p>Today we decided it’s time to build an active sales process. And for this we need an expert in business development who will help us launch active sales worldwide.</p> <p><strong>It is important for us</strong></p> <ul> <li> <p>3 years+ of successful experience in sales of B2B services (ideally — development, design, digital).</p> </li> <li> <p>International (outside CIS) business development skills are a must (amazing if you promoted services in the US).</p> </li> <li> <p><strong>Confident spoken and written English (B2 and above).</strong></p> </li> <li> <p>Nice to have — spoken Russian language.</p> </li> <li> <p>It&#39;s perfect if your time zone is from GMT+1 to GMT+11.</p> </li> </ul> <p><strong>Your future tasks</strong></p> <ul> <li> <p>analyze the market for start-ups and small but growing IT companies as potential clients;</p> </li> <li> <p>search for new clients in America, Europe, and Asia;</p> </li> <li> <p>pack our competitive advantages and expertise into a commercial offer;</p> </li> <li> <p>cold active sales, contact decision makers and negotiate with them;</p> </li> <li> <p>lead generation and transfer warm potential clients to top managers for final negotiations.</p> </li> </ul> <p><strong>MadAppGang offers</strong></p> <ul> <li> <p>Service contract with an Australian company.</p> </li> <li> <p>Full-time job.</p> </li> <li> <p>Salary in USD/EUR/crypto — depends on your experience and expectations.</p> </li> <li> <p>Remote: We are comfortable working remotely, and we follow all the commitments of Remote work.</p> </li> <li> <p>Open to the world: We support your desire to travel and see the world. You can work from any spot on our planet.</p> </li> <li> <p>Team: We are not just a group of people doing one project, we are sharing mindset, views, and values, you will never be alone against your challenges.</p> </li> <li> <p>Growth: We inspire people&#39;s growth and development, you get free English lessons with a qualified IT English teacher and native speaker. We have a self-developed tool for setting goals and achieving them by each team member. Webinars, courses, and conferences for your professional development are fully compensated.</p> </li> <li> <p>Wellness: We care about your health, so we compensate 70% of the cost of the subscription to the gym (or another type of sports activity).</p> </li> <li> <p>Compensation: We compensate 30% if you buy your personal equipment for work.</p> </li> <li> <p>Work and life balance: We guarantee you 24 working days of paid holidays a year.</p> </li> </ul> <p><em><strong>Please highlight in a cover letter what services and in what countries you have sales experience.</strong></em></p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Business Development"},{"name":"Negotiation skills"},{"name":"Sales Skills"},{"name":"Sales Management"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"17.242","name":"Прямые продажи","profarea_id":"17","profarea_name":"Продажи"},{"id":"17.196","name":"Оптовая торговля","profarea_id":"17","profarea_name":"Продажи"},{"id":"17.149","name":"Менеджер по работе с клиентами","profarea_id":"17","profarea_name":"Продажи"}],"professional_roles":[{"id":"70","name":"Менеджер по продажам, менеджер по работе с клиентами"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"4420523","name":"Cellar door","url":"https://api.hh.ru/employers/4420523?host=hh.ru","alternate_url":"https://hh.ru/employer/4420523","logo_urls":{"90":"https://hhcdn.ru/employer-logo/3249632.png","240":"https://hhcdn.ru/employer-logo/3249633.png","original":"https://hhcdn.ru/employer-logo-original/702129.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=4420523&host=hh.ru","trusted":true},"published_at":"2022-12-16T14:09:58+0300","created_at":"2022-12-16T14:09:58+0300","initial_created_at":"2022-12-16T14:09:58+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=73902230","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/73902230","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[{"id":"eng","name":"Английский","level":{"id":"b2","name":"B2 — Средне-продвинутый"}}]}