{"id":"73869421","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Android разработчик в Яндекс.Карты","insider_interview":null,"response_letter_required":false,"area":{"id":"146","name":"Сербия","url":"https://api.hh.ru/areas/146?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Карты и Навигатор ежедневно помогают миллионам пользователей по всему миру решать свои задачи. Найти ресторан или дорогу до места встречи с друзьями, запланировать поход в салон красоты, построить максимально эффективный маршрут на любом типе транспорта или просто узнать, что интересного есть в городе, — наши базовые сценарии, жизненно необходимые современному городскому жителю.</p> <p>Мы не стоим на месте: проводим эксперименты, исследуем потребности пользователей, расширяем возможности существующих сценариев и создаём новые. За последнее время добавили поддержку AndroidAuto, новый виджет, аренду самокатов, заказ такси, доставку еды. Карты и Навигатор превратились в мощный геосуперапп.</p> <p><strong>Как устроена разработка?</strong></p> <p>Важная часть нашего подхода — ставка на мультиплатформенную разработку. Наши приложения на iOS и Android практически идентичны, а функционал настолько разнообразен и обширен, что поддерживать одновременно две реализации трудно и неэффективно. Несколько лет назад мы выбрали KotlinMultiplatform в качестве основной технологии для кросс-платформенной разработки и одними из первых начали использовать её в продакшен. KotlinMultiplatform не накладывает ограничений на использование платформенных SDK, мы пишем на нём только бизнес-логику, а UI и взаимодействие с операционной системой остаются платформенными, что позволяет использовать актуальный стек на Android и iOS. За эти годы мы прошли огромный путь, и сейчас общий код составляет значимую часть нашей кодовой базы. Благодаря этому команды Android и iOS тесно контактируют, обмениваются знаниями, а под новые большие проекты мы сразу собираем кросс-платформенные v-team, что упрощает контроль над процессами и совместные запуски.</p> <p>Наш проект разбит на модули, что улучшает архитектуру и позволяет разрабатывать новые сценарии в отдельных легковесных тестовых проектах. Внутри модулей используем архитектуру Redux с Unidirectional Data Flow.</p> <p>Большой проект невозможно развивать без вложений в инфраструктуру. 80% времени мы тратим на продуктовую разработку, 20% времени выделяем на развитие технологий, автоматизацию рутины и отдачу техдолга. CI/CD, автоматическая синхронизация ресурсов от редакторов и дизайнеров, автоматизации workflow задач, автоматизации релизного процесса, UI-тесты, A/B-эксперименты, мониторинги здоровья приложения и процессов — у нас есть всё необходимое для проекта такого уровня.</p> <p><strong>Какой у нас стек Android?</strong></p> <ul> <li>Kotlin, Gradle, Retrofit, OkHttp, Kotlin Coroutines/Flow, Glide, LeakCanary, Kotlin Multiplatform Mobile, RxJava 2, Ktor, Kinzhal, ktlint, AppMetrica, CameraX, Compose, SpeechKit, MapKit, KotlinX.Serialization, Wire</li> <li>Espresso &amp; Allure для UI-тестов</li> <li>Развитая модульность</li> <li>Dagger 2 для DI</li> <li>Redux (UDF)</li> </ul> <p><strong>Какие сейчас есть вызовы?</strong></p> <p>Прямо сейчас в разгаре большая стройка по UI-тестам. Причём мы и тут используем Kotlin Native для шаринга логики тестов между платформами. Также мы в процессе перехода на релиз двух приложений — Карт и Навигатора — из одной кодовой базы со всеми сопутствующими проблемами. Впереди рывок по процессам: хотим релизиться в два раза чаще, перейти на еженедельный цикл.</p> <p><strong>Помимо этого:</strong></p> <ul> <li>Активно внедряем Compose.</li> <li>Занимаемся оптимизацией сборки и синка проекта.</li> <li>Запланирован проект по оптимизации производительности приложения (время старта, энергопотребление) и пара крупных рефакторингов.</li> </ul> <p><strong>Главный продуктовый вызов</strong> — выход на международные рынки. Новые страны, новые локализации и региональные особенности. Также планируем перезапустить парковочный сценарий, улучшить навигацию по сложным развязкам, собирать больше UGC.</p> <p><strong>Что по атмосфере?</strong></p> <p>Много внимания уделяем обмену знаниями: раз в месяц проводим общие «техновстречи» на всю разработку, на которых рассказываем про интересные исследования и достижения в разных технологических областях, еженедельно собираемся платформенными командами и обсуждаем насущные проблемы. По результатам спринта проводим продуктовые демо. Уважаем work-life balance, тимбилдинговые активности, неформальное общение, вечеринки, поддерживаем дружескую атмосферу. Приветствуем участие в школах мобильной разработки в качестве преподавателей, помогаем с выступлениями на конференциях.</p> <p><strong>Возможно, вы уже видели наши доклады и статьи:</strong></p> <p>Михаил Куренков рассказывает на Mobius 2020 про процессные особенности мультиплатформенной разработки</p> <p>Дмитрий Яковлев рассказывает на AppsLive 2020, как концептуально выглядит типичная фича на Kotlin Multiplatform</p> <p>Денис Загаевский рассказывает на Mobius 2021 про наш DI</p> <p>Большой пост на Хабре от Евгения Васильева про многопоточность в Kotlin Native</p> <p><strong>Мы ждем, что вы:</strong></p> <ul> <li>разрабатывали мобильные приложения для Android и глубоко знаете SDK платформы;</li> <li>умеете прорабатывать задачи от и до, имеете продуктовое мышление, стремитесь улучшать жизнь пользователей;</li> <li>знаете современные принципы построения архитектуры мобильных приложений;</li> <li>готовы совершенствовать процессы и инфраструктуру разработки.</li> </ul> <p><strong>Условия:</strong></p> <ul> <li>высокий доход и премии каждые полгода за эффективную работу;</li> <li>возможность работать над ещё не решёнными задачами, участвовать в обсуждении и предлагать идеи, влиять на процесс и результат;</li> <li>сильная команда, с которой можно расти;</li> <li>расширенная программа ДМС: стоматология, обследования, вызов врача на дом и многое другое;</li> <li>оплата 80% стоимости ДМС для супругов и детей;</li> <li>компенсация оплаты питания;</li> <li>корпоративные скидки в бассейнах, фитнес-центрах и магазинах;</li> <li>курсы, тренинги, участие в конференциях;</li> <li>гибкий график работы;</li> <li>бесплатная парковка.</li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.50","name":"Системы управления предприятием (ERP)","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.9","name":"Web инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.10","name":"Web мастер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"1740","name":"Яндекс","url":"https://api.hh.ru/employers/1740?host=hh.ru","alternate_url":"https://hh.ru/employer/1740","logo_urls":{"90":"https://hhcdn.ru/employer-logo/3790847.png","240":"https://hhcdn.ru/employer-logo/3790848.png","original":"https://hhcdn.ru/employer-logo-original/837491.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=1740&host=hh.ru","trusted":true},"published_at":"2022-12-15T16:54:06+0300","created_at":"2022-12-15T16:54:06+0300","initial_created_at":"2022-12-15T16:51:39+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=73869421","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/73869421","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}