{"id":"73023380","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Development Team Lead (Ruby)","insider_interview":null,"response_letter_required":false,"area":{"id":"13","name":"Армения","url":"https://api.hh.ru/areas/13?host=hh.ru"},"salary":{"from":6000,"to":null,"currency":"USD","gross":false},"type":{"id":"open","name":"Открытая"},"address":{"city":"Тбилиси","street":"улица Жиули Шартава","building":"33","description":null,"lat":41.728085,"lng":44.772977,"raw":"Тбилиси, улица Жиули Шартава, 33","metro":null,"metro_stations":[]},"allow_messages":true,"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Hi there! Thanks for stopping by =]</strong></p> <p>Are you actively looking for a new opportunity? Or just checking the market? Well… you might just be in the right place!</p> <p>We are looking for a new <strong>Development Manager </strong>to help us lead, mentor, and grow a high-performing software development team and cultivate an inclusive environment that inspires the team to do their best work. Under your guidance, the team will take on the critical mission of supporting and enhancing one of our point-of-sale products cloud architectures.</p> <p>If you’re a leader with a solid technical background, have a proven track record of supporting, mentoring, and leading a team, along with a reputation for delivering great software than you might be a perfect fit. If you enjoy problem-solving mixed with pragmatism and collaboration to develop products that solve real-world problems for customers around the globe, then you’re what we’re looking for. Your hands-on attitude and your ability to explore new territories will help you lay out the best plan for the team to succeed on their mission.</p> <p>The smooth communication and collaboration with fellow product, development and DevOps team members around the globe will be an integral to the success of the team. If you are inspired by interesting technical challenges, working on solutions that really matter and strive for excellence within our international team, then we would love to hear from you.</p> <p><strong>Your Mission</strong></p> <p>You will take ownership of the systems and architecture that power a significant portion of Lightspeeds revenue in the Hospitality business unit! You will take an active role in driving a newly formed engineering team dedicated to this infrastructure. Your team’s mandate is to revitalize foundational systems for long term success that many tens of thousands of customers and their guests depend upon daily. You will have agency to make changes at production scale with this senior team whose potential and energy you can focus at your discretion on the toughest problems you see.</p> <p><strong>Primary responsibilities</strong></p> <ul> <li> <p>Drive development of scalable and maintainable architectures</p> </li> <li> <p>Engender trust as lead and partner of development team</p> </li> <li> <p>Work closely with other teams, architects, product managers and the engineering leaders to align on approach and priorities</p> </li> <li> <p>Guide, motivate, and grow your team of senior developers as they solve complex business problems</p> </li> <li> <p>Contribute to continuous improvement of our software delivery processes and practices</p> </li> </ul> <p><strong>Requirements</strong></p> <ul> <li> <p>Experience leading a team of developers through successful software projects</p> </li> <li> <p>Strong experience delivering and managing horizontally scalable systems in production;</p> </li> <li> <p>Advanced skills in Ruby and ideally one other backend language (Java)</p> </li> <li> <p>Hands-on knowledge of major cloud services like AWS, GCP and Azure</p> </li> <li> <p>Professional experience with relational datastores</p> </li> <li> <p>A good understanding of Agile development and continuous delivery best practices</p> </li> <li> <p>Curiosity and passion for diving into stimulating challenges</p> </li> <li> <p>Strong written and verbal English communication skills</p> </li> <li> <p>Ability to provide coaching, mentoring and context to team members</p> </li> </ul> <p><strong>Nice To Have</strong></p> <ul> <li> <p>Interest in eCommerce and POS systems</p> </li> <li> <p>Some frontend experience with Javascript</p> </li> <li> <p>Experience building scalable SaaS solutions</p> </li> <li> <p>Bachelor’s degree in Computer Science, Software Engineering or equivalent</p> </li> </ul> <p><strong>What’s in it for you</strong></p> <ul> <li><strong>Lots of autonomy.</strong> Flexible work culture, and the possibility of remote work.</li> <li><strong>Everyone matters</strong>. Day by day, we improve all our products and processes. We have a global team and flexible work culture that provides many opportunities to grow and develop your career.</li> <li><strong>We care.</strong> We provide Macbooks for our team members so they can take it anywhere and work from any place. We provide training and educational materials to keep everyone updated.</li> <li><strong>We have a concierge service.</strong> If you need to meet someone at the airport, get delivery, or even change tires on your car, we have a team that will do that for you.</li> <li><strong>We are reliable.</strong> Lightspeed was founded in 2004 and remains profitable and self-sustaining. Lightspeed is a public company, and we provide RSU for our employees. We have a head office in Montreal, Canada, and now we are opening offices in Tbilisi and Yerevan. We also have more than 25 offices worldwide, from France to New Zealand.</li> </ul> <p> </p> <p><strong>Who We Are</strong></p> <p>Powering the businesses that are the backbone of the global economy, Lightspeed&#39;s one-stop commerce platform helps merchants innovate to simplify, scale, and provide exceptional customer experiences. Our cloud commerce solution transforms and unifies online and physical operations, multichannel sales, expansion to new locations, global payments, financial solutions, and connection to supplier networks.</p> <p>Founded in Montréal, Canada in 2005, Lightspeed is dual-listed on the New York Stock Exchange (NYSE: LSPD) and Toronto Stock Exchange (TSX: LSPD). With teams across North America, Europe, and Asia Pacific, the company serves retail, hospitality, and golf businesses in over 100 countries.</p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Business Development"},{"name":"Team management"},{"name":"Leadership Skills"},{"name":"Negotiation skills"},{"name":"Английский язык"},{"name":"Ruby"},{"name":"Java"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"12.92","name":"Информационные технологии","profarea_id":"12","profarea_name":"Консультирование"},{"id":"1.327","name":"Управление проектами","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"104","name":"Руководитель группы разработки"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"8902274","name":"Lightspeed","url":"https://api.hh.ru/employers/8902274?host=hh.ru","alternate_url":"https://hh.ru/employer/8902274","logo_urls":{"240":"https://hhcdn.ru/employer-logo/5497893.png","90":"https://hhcdn.ru/employer-logo/5497892.png","original":"https://hhcdn.ru/employer-logo-original/969469.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=8902274&host=hh.ru","trusted":true},"published_at":"2022-12-25T12:43:36+0300","created_at":"2022-12-25T12:43:36+0300","initial_created_at":"2022-11-28T12:43:36+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=73023380","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/73023380","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[{"id":"eng","name":"Английский","level":{"id":"c1","name":"C1 — Продвинутый"}}]}