{"id":"73026457","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Frontend React Developer (remote)","insider_interview":null,"response_letter_required":false,"area":{"id":"146","name":"Сербия","url":"https://api.hh.ru/areas/146?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":false,"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Frontend React Developer (remote)</strong><br /><strong>Senior+ level</strong><br /><br /><strong>About us:</strong></p> <p><strong>Velvetech </strong>is an American global software development company headquartered in Chicago, IL. Velvetech has its developers strategically distributed in 10+ global technical job markets to deliver the best in class software engineering and exceptional client services.</p> <p>We have 20+ years of experience in software and hardware development for clients all around the world, especially for US clients. As an official Microsoft Gold Partner, our company is listed in the top 5 software development companies in Illinois, USA.</p> <p>US clients are leading trading and financial organizations, insurance companies, large healthcare associations, pharmaceutical and energy companies, equipment manufacturers, hi-tech startups, etc.</p> <p><strong>Areas of expertise</strong> are consulting, development, implementation and support of software solutions with modern microservices backends (.NET Core, Node.js, Java, SQL Server, PostgreSQL, MongoDB, Redis, RabbitMQ), web front-ends (React, Angular), and mobile development (Swift, Kotlin, Java). Most of the systems are prepared for cloud infrastructures (AWS, <em>Azure</em>, GCP), and heavily rely on Docker, <em>Kubernetes</em> while modern CI/CD is made using GitLab CI or TeamCity.</p> <p>Principles are based on Agile Methodology, Scrum and Kanban. Various projects coded in GitLab or GitHub are built with multiple coordinated teams, collaborating via Jira, Confluence, MS Teams, and Slack. Velvetech constantly follows the Tech trends and actively cooperates with startups in such breakthrough areas as Machine Learning, the Internet of Things, Blockchain, FPGA, and AI.</p> <p><strong>Responsibilities:</strong></p> <p>If you would like to share your knowledge and experience in designing and implementing user interface components for JavaScript-based web and mobile applications using the React open-source library ecosystem with our friendly team, we invite you to join us.</p> <p>As a new team member, working fully remotely from the coziness of your home, you would be responsible for developing the latest user-facing features using React and building a modern highly responsive web-based user interface. In a friendly environment with the possibility of growing your business and technical skills further along with various certifications and career upgrades, you would be able to have many benefits and a competitive performance-based salary that are waiting for you.</p> <ul> <li> <p>Actively involved from conception to completion with projects that are technologically sound and aesthetically impressive</p> </li> <li> <p>Building reusable components and front-end libraries for future use and translating designs and wireframes into high-quality code</p> </li> <li> <p>Optimizing components for maximum performance across a vast array of web-capable devices and browsers and coordinating with various teams working on distinct layers</p> </li> <li> <p>Redesigning and rewriting the product functionality, developing features to enhance the user experience, and determining the structure and design of the product</p> </li> <li> <p>Evaluating emerging technologies and proposing strategic, innovative, and cost-effective solutions that increase the efficiency, reliability, and integration of the business software</p> </li> <li> <p>Developing the shared component library (currently converting our component library from Flow to TypeScript, migrating from version 9 to 10 of styled components or CSS models)</p> </li> <li> <p>Helping transition our product from the old UI to ASP.NET and transition the scripts in jQuery+React, which inject components in our legacy UI, to a full SPA application (React ^16.13.x)</p> </li> <li> <p>Communicate frontend best practices to the team, enhancing efficiency and performance across the department</p> </li> </ul> <p><strong>Requirements:</strong></p> <p>about 6 years of experience in the following technologies:</p> <ul> <li> <p>Thorough understanding of React and its core principles</p> </li> <li> <p>ES6/ES2015 and React ^16.13.x</p> </li> <li> <p>DOM / HTML5 API, CSS3 and HTML5</p> </li> <li> <p>Package managers npm/yarn</p> </li> <li> <p>Building SPAs</p> </li> <li> <p>Writing tests using Jest + Enzyme</p> </li> <li> <p>REST architecture understanding</p> </li> <li> <p>Independently implementing product features</p> </li> <li> <p>Working in a cross-functional team (Designers, UX researchers, BAs, product managers, and other developers)</p> </li> <li> <p>English level: at least an intermediate level</p> </li> </ul> <p>The following experience will be considered as an advantage:</p> <ul> <li> <p>Flow and Typescript industry experience</p> </li> <li> <p>Latest ECMAScript interest, React and innovations in the world of client-side development.</p> </li> <li> <p>Testing-library and its extensions for hooks and React</p> </li> <li> <p>You like to introduce new tools, expand ESLint, prettier configurations</p> </li> <li> <p>Customization GitLab CI, Docker or webpack</p> </li> <li> <p>NGINX configuration knowledge</p> </li> <li> <p>Our stack, infrastructure, and tools: TypeScript, Flow, Emotion, React, Babel ^7.10.x, Webpack, Rollup, Yarn</p> </li> <li> <p>Jest, Enzyme, Testing-library</p> </li> <li> <p>ESLint, prettier, Commitlint, semantic-release</p> </li> <li> <p>Git, Jira, Confluence, GitLab, Docker, K8S</p> </li> </ul> <p><strong>Benefits:</strong></p> <ul> <li> <p>Velvetech is in the <strong>TOP 5</strong> development companies in Illinois, <strong>USA</strong></p> </li> <li> <p>You have <strong>FLEXIBLE</strong> working conditions and a <strong>COOPERATIVE</strong> environment</p> </li> <li> <p>A C<strong>OMPETITIVE</strong> and performance-based salary, fair compensation and benefits</p> </li> <li> <p>Many <strong>CHALLENGING </strong>and exciting projects with new opportunities and learning</p> </li> <li> <p><strong>GROWTH</strong> opportunities, skills and competencies improvement, and professional certification</p> </li> <li> <p>In-company <strong>TRAINING</strong> (English, Software / DevOps / Project management / Design / Business)</p> </li> </ul> <p><em><strong>Our team:</strong></em></p> <p>We are a friendly team of 150+ professionals where everyone is able to achieve high results and grows professionally not only due to their own knowledge and skills but also with the support of colleagues. Values that we highly appreciate are high performance, responsibility, respect, and loyalty. In order to have a highly motivated team, Velvetech invests in their people, additional education, certification, and others. You choose your career path and we are here to support you!</p> <p>People work together in harmony, encouraging each other to continuously learn, progress, and pursue perfection. Our employees enjoy working as we turn challenges into advantages to share success with each other.</p> <p><strong>You have a chance to become a part of a friendly and professional team that creates robust software solutions to deliver maximum value to our international clients.</strong></p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"react"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.50","name":"Системы управления предприятием (ERP)","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.9","name":"Web инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.10","name":"Web мастер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"642001","name":"Velvetech, LLC","url":"https://api.hh.ru/employers/642001?host=hh.ru","alternate_url":"https://hh.ru/employer/642001","logo_urls":{"original":"https://hhcdn.ru/employer-logo-original/798895.jpg","90":"https://hhcdn.ru/employer-logo/3636467.jpeg","240":"https://hhcdn.ru/employer-logo/3636468.jpeg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=642001&host=hh.ru","trusted":true},"published_at":"2022-12-25T13:27:01+0300","created_at":"2022-12-25T13:27:01+0300","initial_created_at":"2022-11-28T13:27:01+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=73026457","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/73026457","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}