{"id":"73520848","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Middle/Senior Go developer (remote)","insider_interview":null,"response_letter_required":false,"area":{"id":"300","name":"Таиланд","url":"https://api.hh.ru/areas/300?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"between3And6","name":"От 3 до 6 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>We are looking for a Middle/Senior Go developer from anywhere in the world.</strong></p> <p><strong>MadAppGang is a custom development company headquartered in Australia, Sydney.</strong></p> <p>It was founded by an experienced software engineer, Jack Rudenko, in 2011. We have outsourcing, outstaffing and our own projects.</p> <p>MadAppGang’s engineering culture is focused on development and work, not bullshit and bureaucracy. Our company was created by engineers for engineers to work with maximum efficiency and pleasure in a team with cool professionals. The company&#39;s culture is based on Rework and Remote from 37Signals.</p> <p><strong>About MAG&#39;s founder</strong></p> <p>Jack has over 25 years of experience building software. He&#39;s an AWS certified Solution Architect and a lead developer behind Evergen, WebMoney, and Moyo TV.</p> <p><strong>The team</strong></p> <p>The development team is distributed and works remotely from different parts of the world. It consists of 40 amazing people: a founder/CTO, CEO, backend, frontend, mobile developers, an Art director, a UX/UI designer, DevOps engineers, a QA engineer, and Project managers.</p> <p>The team is mostly Russian-speaking, but we are moving towards diversity now.</p> <p><strong>Projects</strong></p> <p>We develop digital products for the web, mobile and cloud. Years of experience and numerous projects with clients of different calibre from all around the globe give us the ability to tailor digital solutions that are a perfect balance between complexity, delivery time and cost. Over the past decade, we`ve built dozens of solutions for the fintech, energy, healthcare, fitness, transportation, and food industries.</p> <p>All our projects are international (Europe, America, Asia and Australia). Therefore, our second language of communication is English.</p> <p><strong>About the project</strong></p> <p>Currently, we are looking for Middle or Senior Go developer for our client, the Australian company Evergen.</p> <p>Evergen is a futuristic project in ecology which will definitely change the world for the better. This is a start-up of a large Australian energy company.</p> <p>The product optimizes the operation of solar and battery systems, allows homeowners to manage their system and control energy costs and environmental impact, to sell and buy solar energy depending on tariffs (kind of trading).</p> <p>Smart technology provides more rational use of energy by orchestrating a large fleet of batteries and creating virtual power plants. This guarantees a fault-tolerant and decentralized energy system of the future.</p> <p>The goal is to get rid of coal-fired power plants in 10 countries by 2023, accelerating the world&#39;s transition to renewable energy. Evergen’s partners — Tesla, LG, SolarEdge, etc.</p> <p>Green projects are always cool, right? Products like this make the world a little better, cleaner and greener :)</p> <p><strong>The whole Evergen development team</strong> — CTO, Go, Node.js, TypeScript, C# developers, frontend developers, Data scientists, DevOps engineers, Project managers, Engineering managers and QA engineers.</p> <p><strong>About the role and future tasks</strong></p> <p>You will be working in the hardware integrations team.</p> <p>The main task is to provide reliable interaction with the cloud Web API of vendors for managing solar panels</p> <p>Guys use a service architecture and DFA approach (Document First Approach). First, they write documentation, discuss it, and then implement it.</p> <p><strong>Technology stack and tools</strong></p> <p>Go, Kafka, MongoDB, Redis, Docker, Kubernetes</p> <p><strong>Agile practices: </strong>stand-up meetings, planning, retro, engineering meetings, demo.</p> <p><strong>It is important for us</strong></p> <ul> <li> <p>Experience in commercial backend development on Go.</p> </li> <li> <p>Skills and understanding of design patterns.</p> </li> <li> <p><strong>Confident spoken and written English (B2 and above).</strong></p> </li> <li> <p><strong>Willingness to attend stand-up meetings at 8:00-9:00 a.m. (GMT+3).</strong></p> </li> </ul> <p><strong>MadAppGang offers</strong></p> <ul> <li> <p>Service contract with an Australian company.</p> </li> <li> <p>Full-time with a fixed hourly rate.</p> </li> <li> <p>Salary in USD/EUR/crypto — depends on your experience and expectations.</p> </li> <li> <p>Remote: We are comfortable working remotely, and we follow all the commitments of Remote work.</p> </li> <li> <p>Open to the world: We support your desire to travel and see the world. You can work from any spot on our planet.</p> </li> <li> <p>Team: We are not just a group of people doing one project, we are sharing mindset, views, and values, you will never be alone against your challenges.</p> </li> <li> <p>Growth: We inspire people&#39;s growth and development, you get free English lessons with a qualified IT English teacher and native speaker. We have a self-developed tool for setting goals and achieving them by each team member. Webinars, courses, and conferences for your professional development are fully compensated.</p> </li> <li> <p>Wellness: We care about your health, so we compensate 70% of the cost of the subscription to the gym (or another type of sports activity).</p> </li> <li> <p>Compensation: We compensate 30% if you decide to buy your personal equipment for work.</p> </li> <li> <p>Work and life balance: We guarantee you 24 working days of paid holidays a year.</p> </li> <li> <p>Career: If you want to learn new technology and possibly shift your focus on different programming languages we are the perfect place for you :)</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.50","name":"Системы управления предприятием (ERP)","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.9","name":"Web инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.10","name":"Web мастер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"4420523","name":"Cellar door","url":"https://api.hh.ru/employers/4420523?host=hh.ru","alternate_url":"https://hh.ru/employer/4420523","logo_urls":{"90":"https://hhcdn.ru/employer-logo/3249632.png","240":"https://hhcdn.ru/employer-logo/3249633.png","original":"https://hhcdn.ru/employer-logo-original/702129.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=4420523&host=hh.ru","trusted":true},"published_at":"2022-12-08T14:29:05+0300","created_at":"2022-12-08T14:29:05+0300","initial_created_at":"2022-12-08T14:29:05+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=73520848","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/73520848","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[{"id":"eng","name":"Английский","level":{"id":"b2","name":"B2 — Средне-продвинутый"}}]}