{"id":"70797542","premium":false,"billing_type":{"id":"standard_plus","name":"Стандарт плюс"},"relations":[],"name":"Team Lead / Development Manager (PHP/Go)","insider_interview":null,"response_letter_required":false,"area":{"id":"13","name":"Армения","url":"https://api.hh.ru/areas/13?host=hh.ru"},"salary":{"from":null,"to":7000,"currency":"USD","gross":false},"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"moreThan6","name":"Более 6 лет"},"schedule":{"id":"fullDay","name":"Полный день"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p>Hi there! Thanks for stopping by</p> <p>Are you actively looking for a new opportunity? Or just checking the market? Well… you might just be in the right place!</p> <p>We are looking for a new <strong>Software Development Team Lead </strong>to help us lead, mentor, and grow a high-performing software development team and cultivate an inclusive environment that inspires the team to do their best work. Under your guidance, the team will take on the critical mission of supporting and enhancing our Retail eCommerce product.</p> <p>If you’re a leader with a solid technical background, have a proven track record of supporting, mentoring, and leading a team, along with a reputation for delivering great software then you might be a perfect fit. If you enjoy problem-solving mixed with pragmatism and collaboration to develop products that solve real-world problems for customers around the globe, then you’re what we’re looking for.</p> <p>The smooth communication and collaboration with fellow product, development and SRE team members around the globe will be an integral to the success of the team. If you are inspired by interesting technical challenges, working on solutions that really matter and strive for excellence within our international team, then we would love to hear from you.</p> <p>At Lightspeed, we are dedicated to bringing cities and communities to life by empowering small and medium businesses. Come help us build our communities!</p> <p><strong>Your Mission</strong></p> <p>You will take an active role in building and driving a passionate engineering team dedicated to the Retail eCommerce platform. Your team&#39;s mandate is to enhance and maintain our global eCommerce platform. The team will contribute to our cloud platform by focusing on software quality, code readability, and the long-term company vision.</p> <p><strong>What you’ll be responsible for</strong></p> <ul> <li> <p>Lead the way to develop performant, scalable and maintainable applications and microservices</p> </li> <li> <p>Be the trusted lead and partner of a development team of 5-6 members</p> </li> <li> <p>Work closely with other teams, architects, product managers and the engineering leaders to align on approach and priorities</p> </li> <li> <p>Guide, motivate, and grow your team of skilled software developers as they solve complex business problems</p> </li> <li> <p>Initiate and contribute to continuous improvement of our software delivery processes and practices</p> </li> <li> <p>Participate in finding top talent for your team and the organization</p> </li> <li> <p>Provide technical and process guidance to your team</p> </li> <li> <p>Participate in code reviews in order to teach and enforce high standards of code quality</p> </li> </ul> <p><strong>What you’ll be bringing to the team</strong></p> <ul> <li> <p>Experience leading a team of developers through successful software projects</p> </li> <li> <p>Solid experience delivering horizontally scalable applications and microservices</p> </li> <li> <p>Advanced skills in PHP, React, Typescript, and/or Go (or ability and willingness to learn some of these languages)</p> </li> <li> <p>Full-stack web development familiarity is a strong plus</p> </li> <li> <p>Professional experience with and solid knowledge of SQL databases</p> </li> <li> <p>Solid understanding of Agile development and continuous delivery best practices</p> </li> <li> <p>Strong written and verbal English communication skills</p> </li> <li> <p>Ability to provide coaching, mentoring and context to team members</p> </li> <li> <p>Passion for learning new things and desire to continuously improve</p> </li> </ul> <p><strong>Even better if you have hands-on experience with (but not necessary):</strong></p> <ul> <li> <p>Interest in or experience with POS and eCommerce systems</p> </li> <li> <p>Experience building scalable SaaS solutions</p> </li> <li> <p>Solid knowledge of major cloud services like AWS, GCP and Azure</p> </li> <li> <p>Project Management or Scrum master experience (or formal training)</p> </li> <li> <p>Understanding clean code and the right level of test automation</p> </li> <li> <p>Bachelor&#39;s degree in Computer Science, Software Engineering or equivalent</p> </li> </ul> <p><strong>Who you are:</strong></p> <ul> <li> <p>You are a problem solver who does not shy away from tackling complexity and critical thinking</p> </li> <li> <p>You have a strong will to learn, grow and get out of your comfort zone</p> </li> <li> <p>You have a great energy and passion for technology</p> </li> </ul> <p><strong>What’s in it for you?</strong></p> <p>Come live the Lightspeed experience!</p> <ul> <li> <p>Lots of autonomy, flexible work culture and the option of fully remote work</p> </li> <li> <p>Genuine career opportunities in a company that’s creating new jobs everyday</p> </li> <li> <p>Opportunity to make a difference; help merchants grow their businesses and become more successful by creating or improving products and addressing customer feedback</p> </li> <li> <p>Work in a team big enough for growth but lean enough to make a real impact</p> </li> <li> <p>Development of very high traffic products, used at the global scale</p> </li> <li> <p>Opportunities to learn and expand your skill set</p> </li> <li> <p>Become a valued part of the diverse and inclusive Lightspeed family</p> </li> </ul>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"Team management"},{"name":"Английский язык"},{"name":"Agile Project Management"},{"name":"Leadership Skills"},{"name":"PHP"},{"name":"Golang"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"12.92","name":"Информационные технологии","profarea_id":"12","profarea_name":"Консультирование"},{"id":"1.327","name":"Управление проектами","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"104","name":"Руководитель группы разработки"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"8902274","name":"Lightspeed","url":"https://api.hh.ru/employers/8902274?host=hh.ru","alternate_url":"https://hh.ru/employer/8902274","logo_urls":{"240":"https://hhcdn.ru/employer-logo/5497893.png","90":"https://hhcdn.ru/employer-logo/5497892.png","original":"https://hhcdn.ru/employer-logo-original/969469.png"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=8902274&host=hh.ru","trusted":true},"published_at":"2022-12-25T11:35:19+0300","created_at":"2022-12-25T11:35:19+0300","initial_created_at":"2022-10-05T11:18:25+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=70797542","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/70797542","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[{"id":"eng","name":"Английский","level":{"id":"c1","name":"C1 — Продвинутый"}}]}