{"id":"72848334","premium":false,"billing_type":{"id":"standard","name":"Стандарт"},"relations":[],"name":"Golang Backend Developer (Geo team)","insider_interview":null,"response_letter_required":false,"area":{"id":"2","name":"Санкт-Петербург","url":"https://api.hh.ru/areas/2?host=hh.ru"},"salary":null,"type":{"id":"open","name":"Открытая"},"address":null,"allow_messages":true,"experience":{"id":"between1And3","name":"От 1 года до 3 лет"},"schedule":{"id":"remote","name":"Удаленная работа"},"employment":{"id":"full","name":"Полная занятость"},"department":null,"contacts":null,"description":"<p><strong>Привет!</strong></p> <p><strong>Меня зовут Егор, я Product Manager компании &quot;Где мои дети&quot;. </strong>Мы в поисках Backend разработчика, которому интересно решать не только технические сложные задачи, но и принимать участие в командных брейнштормах и продуктовых решениях.</p> <p><strong>&quot;Где мои дети&quot; -</strong> сервис, который при помощи мобильного приложения на телефоне ребенка, помогает родителям по всему миру быть спокойнее за своих детей.</p> <ul> <li> <p>более 40 млн. скачиваний в App Store и Google Play;</p> </li> <li> <p>сервис локализован на 45 языков, наши покупатели живут в 175 странах мира;</p> </li> <li> <p>более 4 млн MAU родителей в сервисе;</p> </li> <li> <p>первая строчка в категории “Материнство и детство” Google Play, ТОП-5 категории Образование App Store, десятки фичерингов в сторах приложений;</p> </li> <li> <p>top grossing категории worldwide.</p> </li> </ul> <p>Сегодня &quot;<strong>Где мои дети&quot; </strong>один из наиболее успешных сервисов из РФ, работающих по всему миру. Мы растем минимум вдвое каждый год в течение 4 лет. Команда из 100 человек находится в офисах в Перми и Санкт-Петербурге, около 20% команды работает удаленно.</p> <p><strong>Мы предлагаем не просто хорошую работу в растущей компании с возможностью влиять на продукт и его метрики, но стать совладельцем компании и получать дополнительный доход от роста стоимости компании с помощью нашей опционной программы.</strong></p> <p><strong>О продукте</strong></p> <p><strong>Наша миссия - </strong>помогать родителям воспитывать счастливых и любознательных людей.</p> <p>Для этого в сервисе есть:</p> <ul> <li> <p>точная геолокация, анализ активности ребёнка и контроль окружения ребенка для того, чтобы помочь родителям обеспечивать безопасность детей;</p> </li> <li> <p>аналитика использования приложений, чтобы оградить ребёнка от опасных сервисов;</p> </li> <li> <p>задания для ребёнка, чтобы занять его вечером и дать родителям возможность потратить время на себя;</p> </li> <li> <p>и ещё много полезных функций, которые мы сделаем вместе с тобой.</p> </li> </ul> <p><strong>Мы доверим тебе:</strong></p> <ul> <li>заниматься разработкой серверной части сервиса и поддержкой существующих систем: геотрекинговая платформа, HTTP API Server для приложений, TCP/IP Server для носимых GPS-устройств;</li> <li>принимать активное участие в работе над продуктовыми задачами (мозговые штурмы, разработка новых алгоритмов и т.д.);</li> <li>строить стабильную архитектуру с командой технологического направления.</li> <li>основной стэк технологий: Golang (80%), ClickHouse, Redis\\KeyDB, MySQL, Rabbit MQ, PHP (20%).</li> </ul> <p><strong>Особенности работы в нашей команде:</strong></p> <ul> <li> <p>Agile =) Нужно обсуждать фичи со всеми членами нашей дружной кросс-функциональной команды. Мы стараемся обсудить всё до процесса разработки, но мы люди и иногда что-то упускаем. В таком случае нужно идти и уточнять, что, где, откуда брать или подсвечивать упущенные моменты в требованиях;</p> </li> <li> <p>не менее 10% времени разработки мы тратим на техдолг, улучшение процесса разработки (например, рефакторинг);</p> </li> </ul> <p><br /><strong>Для хорошего старта, необходимо:</strong></p> <p><strong>Соответствовать нашим ценностям:</strong></p> <ul> <li> <p>совершенствуешься и стремишься быть профессионалом;</p> </li> <li> <p>для тебя важно выполнять свои задачи в обещанный срок;</p> </li> <li> <p>умеешь и любишь работать в команде, правильно воспринимаешь конструктивную критику;</p> </li> <li> <p>вовлечен в продукт, участие в создании которого ты принимаешь;</p> </li> <li> <p>мыслишь результатом, а не процессом;</p> </li> <li> <p>не жалуешься на обстоятельства, а улучшаешь обстановку вокруг себя.</p> </li> </ul> <p><strong>Иметь следующие технические навыки:</strong></p> <ul> <li> <p>Знание Golang и опыт работы с высоконагруженными системами;</p> </li> <li> <p>Хорошее знание SQL, умение проектировать базы данных, опыт работы с MySQL / PostgreSQL;</p> </li> <li> <p>Опыт разработки на PHP или умение быстро разбираться в других языках;</p> </li> <li> <p>Плюсом будет опыт в разработке архитектуры, умение применять принципы SOLID.</p> </li> </ul> <p><strong>Принципы OKR и опционная программа:</strong></p> <p>Мы создаем уникальную культуру с высокой вовлеченностью, ориентацией на результат и стремлением создавать лучший продукт. Мы многое просим, но многое и отдаем взамен. Мы ждем от тебя глобальных амбиций и мышление на уровне требуемых результатов.</p> <p><strong>Структурировать процесс нам помогает система OKR:</strong></p> <ul> <li> <p>цели ставятся два раза в год;</p> </li> <li> <p>каждая команда и технологическое направление также имеет свой OKR, синхронизированные с общими целями компании.</p> </li> </ul> <p>Два раза в год компания собирается на стратегическую сессию с целью сформулировать и презентовать свой OKR на ближайшие полгода.</p> <p>Выполняя личные цели и получив положительную ежегодную оценку от коллег, ты получаешь опцион. Опцион не привязан к ожиданиям компании в будущем - выход на IPO, новый раунд инвестиций и тд. Ты получаешь опцион здесь и сейчас, при этом оценка стоимости выданного опциона определяется текущей выручкой компании. С момента получения опциона увеличение стоимости компании напрямую влияет на стоимость твоего опциона.</p> <p><strong>Опцион получают все, программа действует только 5 лет: каждый год ты увеличиваешь как стоимость своей доли, так и ее размер. Это действительно редкое предложение на рынке, поэтому будь проактивен и уточни детали на интервью.</strong></p> <p><strong>То, что должно быть в каждой компании, но есть не у всех:</strong></p> <ul> <li>удаленная работа из любой точки мира (наши команды работают в часовом поясе Мск) либо комфортный офис в Петербурге, Перми;</li> <li>вы можете выбрать ЗП в евро от иностранной компании, либо в рублях в России;</li> <li>опционная программа, в которой компания проводит выкуп твоих акций. Нет нужды ждать продажу компании, можно “обкешить” уже через год;</li> <li>компенсация обучения, даже если оно не профильно твоей роли в команде;</li> <li>льготное кредитование;</li> <li>лояльное отношение к графику работы и отпусков;</li> <li>компенсация занятий спортом (абонементы в тренажерный зал, бассейн, танцы, бокс и другие спортивные секции);</li> <li>компенсация при покупке оборудования для личного пользования.</li> </ul> <p> </p> <p> </p>","branded_description":null,"vacancy_constructor_template":null,"key_skills":[{"name":"PostgreSQL"},{"name":"MySQL"},{"name":"Symfony"},{"name":"Redis"},{"name":"Golang"}],"accept_handicapped":false,"accept_kids":false,"archived":false,"response_url":null,"specializations":[{"id":"1.221","name":"Программирование, Разработка","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.50","name":"Системы управления предприятием (ERP)","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.82","name":"Инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.9","name":"Web инженер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"},{"id":"1.10","name":"Web мастер","profarea_id":"1","profarea_name":"Информационные технологии, интернет, телеком"}],"professional_roles":[{"id":"96","name":"Программист, разработчик"}],"code":null,"hidden":false,"quick_responses_allowed":false,"driver_license_types":[],"accept_incomplete_resumes":false,"employer":{"id":"2076464","name":"Где мои дети","url":"https://api.hh.ru/employers/2076464?host=hh.ru","alternate_url":"https://hh.ru/employer/2076464","logo_urls":{"240":"https://hhcdn.ru/employer-logo/2794640.jpeg","90":"https://hhcdn.ru/employer-logo/2794639.jpeg","original":"https://hhcdn.ru/employer-logo-original/588346.jpg"},"vacancies_url":"https://api.hh.ru/vacancies?employer_id=2076464&host=hh.ru","trusted":true},"published_at":"2022-12-22T14:25:14+0300","created_at":"2022-12-22T14:25:14+0300","initial_created_at":"2022-11-24T09:08:10+0300","negotiations_url":null,"suitable_resumes_url":null,"apply_alternate_url":"https://hh.ru/applicant/vacancy_response?vacancyId=72848334","has_test":false,"test":null,"alternate_url":"https://hh.ru/vacancy/72848334","working_days":[],"working_time_intervals":[],"working_time_modes":[],"accept_temporary":false,"languages":[]}